{"name":"GET - As user I have be able to search article by keyword i input","id":"searcharticle;get---as-user-i-have-be-able-to-search-article-by-keyword-i-input","testSteps":[{"number":1,"description":"Given I set GET api endpoint","duration":7,"startTime":"2023-06-26T15:25:08.027402900+07:00[Asia/Jakarta]","result":"SUCCESS","precondition":false,"level":0,"children":[{"number":2,"description":"I set GET API endpoint","duration":0,"startTime":"2023-06-26T15:25:08.035328100+07:00[Asia/Jakarta]","result":"SUCCESS","precondition":false,"level":1}]},{"number":3,"description":"When I send GET HTTP Request","duration":174,"startTime":"2023-06-26T15:25:08.036329800+07:00[Asia/Jakarta]","result":"SUCCESS","precondition":false,"level":0,"children":[{"number":4,"description":"I send GET HTTP Request","duration":173,"startTime":"2023-06-26T15:25:08.036329800+07:00[Asia/Jakarta]","result":"SUCCESS","precondition":false,"level":1,"children":[{"number":5,"description":"I set GET API endpoint","duration":0,"startTime":"2023-06-26T15:25:08.037745400+07:00[Asia/Jakarta]","result":"SUCCESS","precondition":false,"level":2},{"number":6,"description":"GET https://capstone-project.duckdns.org:8080/articles/search?keyword\u003dmental","duration":0,"startTime":"2023-06-26T15:25:08.210053200+07:00[Asia/Jakarta]","result":"SUCCESS","restQuery":{"method":"GET","path":"https://capstone-project.duckdns.org:8080/articles/search?keyword\u003dmental","content":"","contentType":"null","requestHeaders":"Accept\u003d*/*","requestCookies":"","responseHeaders":"Content-Type: application/json; charset\u003dUTF-8\r\nVary: Origin\r\nDate: Mon, 26 Jun 2023 08:25:14 GMT\r\nTransfer-Encoding: chunked\r","responseCookies":"\r","responseBody":"{\n    \"data\": [\n        {\n            \"id\": 1,\n            \"title\": \"Mendukung Kesehatan Mental: Mengatasi Tantangan dalam Hidup Sehari-hari untuk generasi z\",\n            \"thumbnail\": \"https://s3capstone.s3.ap-southeast-2.amazonaws.com/uploads/article/2023-06-25-1643.png\",\n            \"content\": \"\u003cp\u003e\u003cstrong\u003eKesehatan mental\u003c/strong\u003e adalah aspek penting dari kesejahteraan kita yang tidak boleh diabaikan. Di tengah kehidupan yang serba cepat dan tekanan yang tinggi, penting bagi kita untuk menjaga kesehatan mental kita agar tetap seimbang dan bahagia. Berikut ini adalah beberapa tips untuk mengatasi tantangan dalam hidup sehari-hari dan mendukung kesehatan mental kita:\u003c/p\u003e\u003col\u003e\u003cli\u003eMengelola Stres: Stres dapat memiliki dampak negatif pada kesehatan mental kita. Penting bagi kita untuk mengenali tanda-tanda stres dan mengambil langkah-langkah untuk mengelolanya. Carilah cara-cara untuk meredakan stres seperti olahraga, meditasi, atau melakukan hobi yang kita sukai.\u003c/li\u003e\u003cli\u003eMenjaga Keseimbangan Hidup: Penting bagi kita untuk menciptakan keseimbangan antara pekerjaan, kehidupan pribadi, dan waktu istirahat. Berikan waktu untuk diri sendiri, keluarga, dan teman-teman, serta lakukan aktivitas yang menyenangkan untuk mengisi energi positif.\u003c/li\u003e\u003cli\u003eMengembangkan Dukungan Sosial: Membangun hubungan yang sehat dan saling mendukung dengan orang lain dapat membantu mengatasi tantangan dan meningkatkan kesehatan mental. Carilah dukungan dari keluarga, teman, atau bahkan bergabung dengan komunitas yang memiliki minat yang sama.\u003c/li\u003e\u003cli\u003eBerlatih Self-Care: Jangan lupa merawat diri sendiri secara fisik dan emosional. Lakukan kegiatan yang membuat kita merasa baik, seperti tidur yang cukup, mengonsumsi makanan bergizi, dan melibatkan diri dalam kegiatan yang memberikan kepuasan.\u003c/li\u003e\u003cli\u003eMencari Bantuan Profesional: Jika kita merasa kesulitan mengatasi masalah kesehatan mental kita sendiri, jangan ragu untuk mencari bantuan profesional. Konselor, psikolog, atau psikiater dapat memberikan bantuan dan dukungan yang diperlukan.\u003c/li\u003e\u003c/ol\u003e\u003cp\u003eMendukung kesehatan mental adalah investasi jangka panjang dalam kesejahteraan dan kebahagiaan kita. Dengan menghadapi tantangan dalam hidup sehari-hari dengan sikap yang positif dan mengambil langkah-langkah untuk menjaga kesehatan mental kita, kita dapat mencapai kualitas hidup yang lebih baik dan lebih seimbang secara keseluruhan.\u003c/p\u003e\",\n            \"category\": \"Kesehatan Mental\"\n        },\n        {\n            \"id\": 12,\n            \"title\": \"Kesehatan mental kaum rebahan generasi Z tahun 2023\",\n            \"thumbnail\": \"https://s3capstone.s3.ap-southeast-2.amazonaws.com/uploads/article/2023-06-25-8720.png\",\n            \"content\": \"\u003cp style\u003d\\\"outline: rgb(255, 0, 0) solid 2px;\\\"\u003eGenerasi Z atau sebagai gen Z (lahir antara 1996-2012) disebut punya mental yang lemah. Terdapat banyak orang, khususnya generasi-generasi sebelumnya yang memberi cap mental sensitive. Aktivis HAM dan penggiat inklusi Bahrul Fuad, mengungkapkan bahwa hal itu hanyalah stigma. Dia mengungkapkan cap ini terjadi lantaran perhatian dan kesadaran soal kesehatan mental di masa lalu belum seperti sekarang. Saat ini, Gen Z dianggap lebih sadar soal kesehatan mental sehingga negatifnya mereka tak jarang menjadikan kesehatan mental untuk melindungi dirinya.\u003c/p\u003e\u003cp style\u003d\\\"outline: rgb(255, 0, 0) solid 2px;\\\"\u003ePresiden Asosiasi Pencegahan Bunuh Diri Indonesia (INASP) Sandersan Onie mengungkapkan bahwa mental gen Z saat ini memang lebih rentan depresi. Berbagai tantangan dan persaingan yang jauh lebih berat dianggap jadi penyebab utama mental Gen Z disebut lemah. Selain itu, media sosial yang membuat mereka jadi sibuk membandingkan diri sendiri dengan persona sempurna yang diunggah di dunia maya.\u003c/p\u003e\u003cp style\u003d\\\"outline: rgb(255, 0, 0) solid 2px;\\\"\u003e“Anak saat bertumbuh tidak cuma dibandingkan dengan kakak, adik atau teman, tapi di media sosial dibandingkan dengan anak dari seluruh dunia,” katanya. Meski demikian, mental Gen Z dianggap lebih berani mengakui kerapuhan dirinya karena mereka terpapar informasi mengenai kesehatan mental. Hal ini, katanya, patut diapresiasi lantaran butuh keberanian untuk mengakuinya.\u003c/p\u003e\u003cp style\u003d\\\"outline: rgb(255, 0, 0) solid 2px;\\\"\u003eRiset Kesehatan Dasar (Riskesdas) 2018, menunjukkan lebih dari 19 juta penduduk berusia lebih dari 15 tahun mengalami gangguan mental emosional, dan lebih dari 12 juta penduduk berusia lebih dari 15 tahun mengalami depresi. Selain itu berdasarkan Sistem Registrasi Sampel yang dilakukan Badan Litbangkes tahun 2016, diperoleh data bunuh diri pertahun sebanyak 1.800 orang atau setiap hari ada 5 orang melakukan bunuh diri, serta 47,7% korban bunuh diri adalah pada usia 10-39 tahun yang merupakan usia anak remaja dan usia produktif. Direktur Pencegahan dan Pengendalian Masalah Kesehatan Jiwa dan Napza Dr.Celestinus Eigya Munthe menjelaskan masalah kesehatan jiwa di Indonesia terkait dengan masalah tingginya prevalensi orang dengan gangguan jiwa. Untuk saat ini Indonesia memiliki prevalensi orang dengan gangguan jiwa sekitar 1 dari 5 penduduk, artinya sekitar 20% populasi di Indonesia itu mempunyai potensi-potensi masalah gangguan jiwa.\u003c/p\u003e\",\n            \"category\": \"Depresi\"\n        }\n    ],\n    \"message\": \"success get articles\"\n}","statusCode":200},"precondition":false,"level":2}]}]},{"number":7,"description":"Then I receive valid HTTP response code is 200","duration":2,"startTime":"2023-06-26T15:25:08.211084800+07:00[Asia/Jakarta]","result":"SUCCESS","precondition":false,"level":0,"children":[{"number":8,"description":"I receive valid HTTP response code is 200","duration":0,"startTime":"2023-06-26T15:25:08.212159800+07:00[Asia/Jakarta]","result":"SUCCESS","precondition":false,"level":1}]},{"number":9,"description":"And I receive valid data for article based on my keyword","duration":17,"startTime":"2023-06-26T15:25:08.213662+07:00[Asia/Jakarta]","result":"SUCCESS","precondition":false,"level":0,"children":[{"number":10,"description":"I receive valid data for article based on my keyword","duration":17,"startTime":"2023-06-26T15:25:08.213662+07:00[Asia/Jakarta]","result":"SUCCESS","precondition":false,"level":1}]}],"userStory":{"id":"searcharticle","storyName":"SearchArticle","displayName":"SearchArticle","path":"SearchArticleUser.feature","narrative":"  As an user\n  I want to search article\n  So that I can see and choose article i want to read","type":"feature","qualifiedTag":{"name":"SearchArticle","type":"feature","displayName":"SearchArticle"}},"featureTag":{"name":"SearchArticle","type":"feature","displayName":"SearchArticle"},"title":"GET - As user I have be able to search article by keyword i input","description":"","tags":[{"name":"SearchArticle","type":"feature","displayName":"SearchArticle"}],"allTags":[{"name":"SearchArticle","type":"feature","displayName":"SearchArticle"}],"startTime":"2023-06-26T15:25:08.025378900+07:00[Asia/Jakarta]","duration":207,"projectKey":"","isManualTestingUpToDate":false,"manual":false,"testSource":"Cucumber","result":"SUCCESS"}